import React from 'react';

export default function AboutUs() {
  return (
    <div className="navbar-offset">
      <div className="container">
        <div className="row">
          <div className="col">
            <h3 className="text-center mb-3">
              <b>Автопрокат у Львові від компанії ALIN</b>
            </h3>
            <p>
              Компанія з 2016 року надає послуги з прокату автомобілів без
              водія. Автопарк компанії у Львові – це сучасні автомобілі,
              оснащення яких, задовольнить смаки і переваги клієнта. Щоб
              показати серйозність намірів в бізнесі, часто необхідно
              підкреслити високий статус перед партнерами. У цьому допоможе
              оренда у Львові авто преміум або бізнес-класу. Для клієнтів, які
              не готові платити за статусні автомобілі, компанія надасть
              автотранспорт середнього або економ-класу. У компанії Alin є раннє
              бронювання автомобілів марок: VW, Mitsubishi, Subaru, Suzuki,
              Ford, Peugeot, Renault, Dacia. Транспорт пройшов техогляд, згідно
              з вимогами українського законодавства. Орендовані машини
              застраховані від поломки, нещасних випадків водія та пасажирів.
            </p>
            <p>При оренді автомобілів в ALIN кожен клієнт оцінить переваги:</p>
            <ul>
              <li>
                в оренду здаються лише нові автомобілі, рік випуску яких не
                пізніше 2016 року;
              </li>
              <li>вартість прокату автомобіля без водія від $19;</li>
              <li>
                взяти машину на прокат у Львові можна протягом 6-12 годин,
                телефонуйте за номером +38 098 777 1600 і оформляйте заявку;
              </li>
              <li>
                форма оплати на вибір: готівкою, через банк або через платіжні
                термінал кредитними картами;
              </li>
              <li>
                франшиза при оренді становить від $350 до $1200, в залежності
                від класу авто;
              </li>
              <li>
                мінімальний пакет документів для оформлення авто на прокат:
                паспорт (цивільний або закордонний) і водійське посвідчення;
              </li>
              <li>
                при необхідності автотранспорт комплектується додатковими
                обладнанням (GPS-навігатор, зарядне-тримач для телефона, дитяче
                крісло)
              </li>
              <p className="mt-3">
                Бути на висоті і вільно пересуватися по місту допоможе компанія
                Alin – прокат авто у Львові.
              </p>
              <p className="mt-3">
                Телефонуйте <b>+38 098 777 1600</b> і дізнайтеся деталі!
              </p>
            </ul>
          </div>
        </div>
      </div>
    </div>
  );
}
