import React, { useEffect, useState } from 'react';
import { useTranslation } from 'react-i18next';

export default function AboutUs() {
  const [language, setLanguage] = useState('ua');
  const { t, i18n } = useTranslation();

  useEffect(() => {
    changeLanguage(localStorage.getItem('lang') || 'ua');
  }, [language]);

  function changeLanguage(newLanguage) {
    const newLang = newLanguage;
    localStorage.setItem('lang', newLang);
    setLanguage(newLang);
    i18n.changeLanguage(newLang);
  }

  return (
    <div className="navbar-offset">
      <div className="container">
        <div className="row">
          <div className="col">
            <h3 className="text-center mb-3">
              <b>{t('Автопрокат у Львові від компанії ALIN')}</b>
            </h3>
            <p>
              {t(
                'Компанія з 2016 року надає послуги з прокату автомобілів без водія. Автопарк компанії у Львові – це сучасні автомобілі, оснащення яких, задовольнить смаки і переваги клієнта. Щоб показати серйозність намірів в бізнесі, часто необхідно підкреслити високий статус перед партнерами. У цьому допоможе оренда у Львові авто преміум або бізнес-класу. Для клієнтів, які не готові платити за статусні автомобілі, компанія надасть автотранспорт середнього або економ-класу. У компанії Alin є раннє бронювання автомобілів марок- VW, Mitsubishi, Subaru, Suzuki, Ford, Peugeot, Renault, Dacia. Транспорт пройшов техогляд, згідно з вимогами українського законодавства. Орендовані машини застраховані від поломки, нещасних випадків водія та пасажирів.'
              )}
            </p>
            <p>
              {t('При оренді автомобілів в ALIN кожен клієнт оцінить переваги')}
            </p>
            <ul>
              <li>
                {t(
                  'в оренду здаються лише нові автомобілі, рік випуску яких не пізніше 2016 року'
                )}
              </li>
              <li>{t('вартість прокату автомобіля без водія від $19')}</li>
              <li>
                {t(
                  'взяти машину на прокат у Львові можна протягом 6-12 годин, телефонуйте за номером +38 098 777 1600 і оформляйте заявку'
                )}
              </li>
              <li>
                {t(
                  'форма оплати на вибір - готівкою, через банк або через платіжні термінал кредитними картами'
                )}
              </li>
              <li>
                {t(
                  'франшиза при оренді становить від $350 до $1200, в залежності від класу авто'
                )}
              </li>
              <li>
                {t(
                  'мінімальний пакет документів для оформлення авто на прокат - паспорт (цивільний або закордонний) і водійське посвідчення'
                )}
              </li>
              <li>
                {t(
                  'при необхідності автотранспорт комплектується додатковими обладнанням (GPS-навігатор, зарядне-тримач для телефона, дитяче крісло)'
                )}
              </li>
              <p className="mt-3">
                {t(
                  'Бути на висоті і вільно пересуватися по місту допоможе компанія Alin – прокат авто у Львові.'
                )}
              </p>
              <p className="mt-3">
                {t('Телефонуйте')} <b>+38 098 777 1600</b>{' '}
                {t('і дізнайтеся деталі!')}
              </p>
            </ul>
          </div>
        </div>
      </div>
    </div>
  );
}
